app/Controllers/Karyawan.php

SELECT *
FROM `produk`
---
public function inventaris()
    {
        // Anda mungkin tidak perlu $produkModel->findAll()
        // jika ini adalah halaman INPUT
        $produkModel = new ProdukModel();

        $data = [
            'title'  => 'Input Inventaris', // Ganti judulnya
            'produk' => $produkModel->findAll() // Anda mungkin masih perlu ini
        ];

SELECT *
FROM `produk`
WHERE `stok` > 0
---
    public function input_penjualan()
    {
        $produkModel = new ProdukModel();

        $data = [
            'title'  => 'Input Transaksi Penjualan',
            'produk' => $produkModel->where('stok >', 0)->findAll() // Hanya tampilkan produk yg ada stok
        ];