app/Controllers/Karyawan.php

SELECT *
FROM `produk`
WHERE `stok` > 0
---
    public function input_penjualan()
    {
        $produkModel = new ProdukModel();

        $data = [
            'title'  => 'Input Transaksi Penjualan',
            'produk' => $produkModel->where('stok >', 0)->findAll() // Hanya tampilkan produk yg ada stok