app/Controllers/Login.php

    public function auth()
    {
        $session = session();
        $model = new \App\Models\UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'penjualan'
 LIMIT 1