app/Controllers/PenjualanController.php

SELECT `penjualan`.*, `pelanggan`.`nama_pelanggan`
FROM `penjualan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `penjualan`.`id_pelanggan`
ORDER BY `penjualan`.`tanggal` DESC, `penjualan`.`id_penjualan` DESC
---
    public function riwayat_penjualan()
    {
        $penjualanModel = new PenjualanModel();

        $data = [
            'title' => 'Riwayat Transaksi Penjualan',
            'penjualan' => $penjualanModel
                ->select('penjualan.*, pelanggan.nama_pelanggan')
                ->join('pelanggan', 'pelanggan.id_pelanggan = penjualan.id_pelanggan', 'left')
                ->orderBy('penjualan.tanggal', 'DESC')
                ->orderBy('penjualan.id_penjualan', 'DESC')
                ->findAll()

SELECT *
FROM `produk`
WHERE `stok` > 0
---
    public function input_penjualan()
    {
        $produkModel = new ProdukModel();
        $data = [
            'title'  => 'Input Transaksi Penjualan',
            'produk' => $produkModel->where('stok >', 0)->findAll()