app/Models/DetailPenjualanModel.php

    public function getDetailItems($id_penjualan)
    {
        return $this->db->table('detail_penjualan as dp')
            ->select('dp.*, p.nama_produk, p.gambar_produk') // Ambil semua dari detail, dan nama_produk
            ->join('produk as p', 'p.id_produk = dp.id_produk', 'left')
            ->where('dp.id_penjualan', $id_penjualan)
            ->get()
            ->getResultArray(); // Kembalikan sebagai array
---
SELECT `dp`.*, `p`.`nama_produk`, `p`.`gambar_produk`
FROM `detail_penjualan` as `dp`
LEFT JOIN `produk` as `p` ON `p`.`id_produk` = `dp`.`id_produk`
WHERE `dp`.`id_penjualan` = '1'