app/Models/PenjualanModel.php

SELECT `penjualan`.*, `pelanggan`.`nama_pelanggan`, `user`.`username`
FROM `penjualan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `penjualan`.`id_pelanggan`
LEFT JOIN `user` ON `user`.`id_user` = `penjualan`.`id_user`
WHERE `penjualan`.`id_penjualan` = '1'
---
    public function getPenjualanById($id_penjualan)
    {
        return $this->db->table('penjualan')
            ->select('penjualan.*, pelanggan.nama_pelanggan, user.username')

            ->join('pelanggan', 'pelanggan.id_pelanggan = penjualan.id_pelanggan', 'left')
            ->join('user', 'user.id_user = penjualan.id_user', 'left')

            ->where('penjualan.id_penjualan', $id_penjualan)

            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `penjualan`
WHERE `tanggal` = '2025-11-15'
AND `id_user` = '1'
SELECT SUM(`total`) AS `total_omzet`
FROM `penjualan`
WHERE `tanggal` = '2025-11-15'
AND `id_user` = '1'
SELECT SUM(`dp`.`qty`) AS `total_qty`
FROM `detail_penjualan` as `dp`
JOIN `penjualan` as `p` ON `p`.`id_penjualan` = `dp`.`id_penjualan`
WHERE `p`.`tanggal` = '2025-11-15'
AND `p`.`id_user` = '1'
SELECT `penjualan`.*, `pelanggan`.`nama_pelanggan`
FROM `penjualan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `penjualan`.`id_pelanggan`
WHERE `penjualan`.`id_user` = '1'
ORDER BY `penjualan`.`id_penjualan` DESC
 LIMIT 5
---
    public function getDashboardData()
    {
        $today = date('Y-m-d');
        $id_user = session()->get('user_id');

        // transaksi hari ini
        $penjualan_hari_ini = $this->where('tanggal', $today)
            ->where('id_user', $id_user)
            ->countAllResults();

        // omzet Hari Ini
        $omzet_hari_ini = $this->selectSum('total', 'total_omzet')
            ->where('tanggal', $today)
            ->where('id_user', $id_user)
            ->get()
            ->getRow()
            ->total_omzet;

        // produk terjual hari ini (Total Qty dari detail)
        $db = \Config\Database::connect();
        $produk_terjual_hari_ini = $db->table('detail_penjualan as dp')
            ->join('penjualan as p', 'p.id_penjualan = dp.id_penjualan')
            ->where('p.tanggal', $today)
            ->where('p.id_user', $id_user)
            ->selectSum('dp.qty', 'total_qty')
            ->get()
            ->getRow()
            ->total_qty;

        // 5 transaksi terakhir
        $transaksi_terakhir = $this
            ->select('penjualan.*, pelanggan.nama_pelanggan')
            ->join('pelanggan', 'pelanggan.id_pelanggan = penjualan.id_pelanggan', 'left')
            ->where('penjualan.id_user', $id_user)
            ->orderBy('penjualan.id_penjualan', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT SUM(`total`) AS `total_omzet`
FROM `penjualan`
WHERE `tanggal` = '2025-11-09'
AND `id_user` = '1'
---
    public function getChartDataLast7Days()
    {
        $id_user = session()->get('user_id');
        $labels = [];
        $data = [];

        // buat array 7 tanggal terakhir
        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $labels[] = date('d M', strtotime($date));

            // ambil data dari DB untuk tanggal tsb
            $query = $this->selectSum('total', 'total_omzet')
                ->where('tanggal', $date)
                ->where('id_user', $id_user)
                ->get()
                ->getRow();